{
  "backend/main.mo": "Motoko canister defining provider, patient, consultation, fitness, and membership data with authorization checks and profile/provider management APIs.",
  "feature_evidence.json": "Machine-readable feature report linking high-level features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains a JSON object summarizing the AdminMembershipPlansPanel React component for CRUD management of membership plans.",
  "frontend/index.css": "Tailwind CSS config defining global styles, theme variables, and dark mode tokens for the UI.",
  "frontend/index.html": "Root HTML file loading the React app via main.tsx and defining the page shell.",
  "frontend/src/App.tsx": "Main React router configuration defining all top-level routes and wrapping the app in theme and toaster providers.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication guard component that requires Internet Identity login and loads the caller’s profile before rendering children.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for first-time users to create and save their profile using the backend API.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout component with navigation, auth handling, and responsive mobile menu driven by identity and user role.",
  "frontend/src/components/vip/VIPBadge.tsx": "Displays a VIP badge with tooltip when the user has VIP status.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, status tracking, and persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, roles, providers, and consultations via the actor.",
  "frontend/src/index.css": "Re-exports global CSS from the parent index file.",
  "frontend/src/lib/nutrition/rules.ts": "Generates nutrition recommendations based on profile, goals, preferences, allergies, and activity level.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/account/AccountPage.tsx": "Account page showing editable user profile, VIP status, and profile setup flow behind auth gate.",
  "frontend/src/pages/admin/AdminFitnessPanel.tsx": "Admin UI for listing, adding, editing, and deleting fitness class offerings using CRUD query hooks and a form dialog.",
  "frontend/src/pages/admin/AdminMembershipPlansPanel.tsx": "Admin panel to manage membership plans with create, edit, and delete functionality via modal forms and query hooks.",
  "frontend/src/pages/admin/AdminPage.tsx": "Main admin dashboard that checks admin permissions and displays tabs for managing providers, fitness listings, and membership plans.",
  "frontend/src/pages/admin/AdminProvidersPanel.tsx": "Admin interface for listing providers and creating new provider entries through a modal form.",
  "frontend/src/pages/consultations/ConsultationsPage.tsx": "User page for viewing consultations and requesting new appointments with providers through a dialog form.",
  "frontend/src/pages/fitness/FitnessPage.tsx": "Fitness listings page that filters Zumba and gym offerings by type, mode, and location, with VIP status support.",
  "frontend/src/pages/my-care/MyCareAssistantPage.tsx": "Renders a care assistant interface where users can add, categorize, and view personal health-related entries. Manages entry creation via dialog and displays filtered items with icons and colors.",
  "frontend/src/pages/nutrition/NutritionPage.tsx": "Displays a nutrition survey and generates personalized nutrition recommendations based on user profile and inputs. Handles form state, activity level selection, and recommendation rendering.",
  "frontend/src/pages/pricing/PricingPage.tsx": "Shows membership plans with pricing, duration labels, VIP status indicators, and loading states. Highlights popular plans and supports plan listing and selection.",
  "frontend/src/pages/providers/ProviderDetailPage.tsx": "Fetches and displays details for a single provider, including consultation options and biography. Supports navigation and booking behavior depending on authentication state.",
  "frontend/src/pages/providers/ProvidersDirectoryPage.tsx": "Lists healthcare providers with category filtering and a hero section describing services. Includes category icons, filtering logic, and navigation to provider details.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash), persist them in sessionStorage, and clear them from session state or URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, container settings, shadows, and keyframes, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file storing project metadata, feature list, requirements mapping, issues, and image needs for a healthcare website platform."
}